back-end/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", ""]]
---
  def create
    user = User.find_for_database_authentication(email: params[:email])